package fifth;

public class Task9 {
    /**
     * Если происходят ошибки, то программа останавливает работу,а пользователю выводится stacktrace
     *
     Может лишить смысла, потому что если есть ошибка, то она вылетит и отобразится в консоли,
     а начинающий программист НИЧЕГО не поймет, что это, откуда, и зачем
     файл может не существовать
     конструкторы должны создавать
     */
    // в сканнере - lastException
    //Самое последнее исключение IOException, созданное базовым объектом для чтения,
    // может быть получено с помощью метода ioException().
    // в PrintWriter - trouble и checkError
}
